# Occupation

### Introduction:


### Step 1. Import the necessary libraries

In [130]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [131]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep = '|')
users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

### Step 4. Discover what is the mean age per occupation

In [132]:
data_gb = users.groupby('occupation')['age'].mean()
data_gb

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [133]:
df = pd.concat([users[data['gender'] == 'M'].groupby('occupation')['gender'].count(), users[users['gender'] == 'F'].groupby('occupation')['gender'].count()], axis=1 , sort=False)

In [134]:
df.columns = ['M_num','F_num']
df['ratioMF'] = df.iloc[:,0] / df.iloc[:,1]
df.sort_values(by = 'ratioMF', ascending = False)

               M_num  F_num    ratioMF
engineer          65    2.0  32.500000
technician        26    1.0  26.000000
retired           13    1.0  13.000000
programmer        60    6.0  10.000000
executive         29    3.0   9.666667
scientist         28    3.0   9.333333
entertainment     16    2.0   8.000000
lawyer            10    2.0   5.000000
salesman           9    3.0   3.000000
educator          69   26.0   2.653846
student          136   60.0   2.266667
other             69   36.0   1.916667
marketing         16   10.0   1.600000
writer            26   19.0   1.368421
none               5    4.0   1.250000
administrator     43   36.0   1.194444
artist            15   13.0   1.153846
librarian         22   29.0   0.758621
healthcare         5   11.0   0.454545
homemaker          1    6.0   0.166667
doctor             7    NaN        NaN

### Step 6. For each occupation, calculate the minimum and maximum ages

In [135]:
df = pd.concat([users.groupby('occupation')['age'].min(), users.groupby('occupation')['age'].max()], axis=1 , sort=False)
df.columns = ['min_age','max_age']
df

               min_age  max_age
occupation
administrator       21       70
artist              19       48
doctor              28       64
educator            23       63
engineer            22       70
entertainment       15       50
executive           22       69
healthcare          22       62
homemaker           20       50
lawyer              21       53
librarian           23       69
marketing           24       55
none                11       55
other               13       64
programmer          20       63
retired             51       73
salesman            18       66
scientist           23       55
student              7       42
technician          21       55
writer              18       60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [136]:
data_gb = data.groupby(['occupation', 'gender'])['age'].mean()
data_gb

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [143]:
df = pd.concat([users[users['gender'] == 'M'].groupby('occupation')['gender'].count(), users[users['gender'] == 'F'].groupby('occupation')['gender'].count()], axis=1 , sort=False)
df['percentage_of_women'] = df.iloc[:,1] / (df.iloc[:,1] + df.iloc[:,0]) * 100
df['percentage_of_men'] = df.iloc[:,0] / (df.iloc[:,1] + df.iloc[:,0]) * 100
df.drop(columns=['gender'], inplace=True)
df

               percentage_of_women  percentage_of_men
administrator            45.569620          54.430380
artist                   46.428571          53.571429
doctor                         NaN                NaN
educator                 27.368421          72.631579
engineer                  2.985075          97.014925
entertainment            11.111111          88.888889
executive                 9.375000          90.625000
healthcare               68.750000          31.250000
homemaker                85.714286          14.285714
lawyer                   16.666667          83.333333
librarian                56.862745          43.137255
marketing                38.461538          61.538462
none                     44.444444          55.555556
other                    34.285714          65.714286
programmer                9.090909          90.909091
retired                   7.142857          92.857143
salesman                 25.000000          75.000000
scientist                 9.677419          90.322581
student                  30.612245          69.387755
technician                3.703704          96.296296
writer                   42.222222          57.777778